soapenv.html

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:ser="http://soapdemo/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:sayHello>
         <name>Aruna</name>
      </ser:sayHello>
   </soapenv:Body>
</soapenv:Envelope>
